tap "mongodb/brew"
tap "weaveworks/tap"
brew "aws-nuke"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "chezmoi"
brew "cloud-nuke"
brew "cocoapods"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "gnupg"
brew "helm"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "mas"
brew "openjdk"
brew "maven"
brew "minikube"
brew "node"
brew "mongosh"
brew "nginx"
brew "nvm"
brew "openjdk@17"
brew "openjdk@21"
brew "php"
brew "pinentry-mac"
brew "postgresql@15"
brew "qpdf"
brew "starship"
brew "swiftformat"
brew "vercel-cli"
brew "xcbeautify"
brew "xcode-build-server"
brew "zsh-completions"
brew "mongodb/brew/mongodb-database-tools"
brew "weaveworks/tap/eksctl"
cask "1password"
cask "aerial"
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-studio"
cask "antigravity"
cask "audacity"
cask "boop"
cask "box-drive"
cask "chatgpt"
cask "claude-code"
cask "coconutbattery"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "eclipse-ide"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-profont-nerd-font"
cask "free-ruler"
cask "gimp"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "google-drive"
cask "handbrake-app"
cask "microsoft-azure-storage-explorer"
cask "microsoft-teams"
cask "miniconda"
cask "mongodb-compass"
cask "obs"
cask "ollama-app"
cask "omnidisksweeper"
cask "onedrive"
cask "postman"
cask "redis-insight"
cask "syntax-highlight"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Developer", id: 640199958
mas "Final Cut Pro", id: 424389933
mas "iMovie", id: 408981434
mas "Keynote", id: 361285480
mas "Motion", id: 434290957
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "PhotoScape X", id: 929507092
mas "Prime Video", id: 545519333
mas "QR Journal", id: 483820530
mas "Slack", id: 803453959
mas "Stockfish", id: 801463932
mas "Super Agent", id: 1568262835
mas "Swift Playground", id: 1496833156
mas "System Designer", id: 1102494854
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "Userscripts", id: 1463298887
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "continue.continue"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
